Revit 2027 API
ToggleButtonData Class
This class contains information necessary to construct a toggle button in a RadioButtonGroup.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.PushButtonData
 Autodesk.Revit.UI.ToggleButtonData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ToggleButtonData : PushButtonData
Public Class ToggleButtonData
	Inherits PushButtonData
public ref class ToggleButtonData : public PushButtonData
type ToggleButtonData =
    class
        inherit PushButtonData
    end
The ToggleButtonData type exposes the following members.
Constructors
Name | Description
ToggleButtonData(String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand.
ToggleButtonData(String, String, String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked.
Top
Properties
Name | Description
AssemblyName | The assembly path of the button.
(Inherited from PushButtonData)
AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button.
(Inherited from PushButtonData)
ClassName | The name of the class containing the implementation for the command.
(Inherited from PushButtonData)
Image | The image of the button.
(Inherited from ButtonData)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ItemData)
LargeImage | The large image of the button.
(Inherited from ButtonData)
LongDescription |  Long description of the command tooltip
(Inherited from RibbonItemData)
Name |  The internal name of the item.
(Inherited from ItemData)
Text | The user-visible text of the button.
(Inherited from ButtonData)
ToolTip |  The tooltip of item.
(Inherited from ItemData)
ToolTipImage | The image to show as a part of the button extended tooltip
(Inherited from RibbonItemData)
Top
Methods
Name | Description
Dispose
(Inherited from ItemData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetContextualHelp | Gets the contextual help bound with this control.
(Inherited from RibbonItemData)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetContextualHelp | Sets the contextual help bound with this button data.
(Inherited from RibbonItemData)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI Namespace